Revit 2026 API

# TransactionAttribute Properties

---

The TransactionAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Mode | Transaction mode. |
|  | TypeId | When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute) |

#### Reference

TransactionAttribute Class

Autodesk.Revit.Attributes Namespace